PCIS_prod/src/Catalogs/Проект/Проект.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Проект</name>
  <attributes>
    <name>ПланДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

PCIS_prod/src/Catalogs/Этап/Этап.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Этап</name>
  <owners>Catalog.Проект</owners>
  <attributes>
    <name>ПланДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветЭтапа</name>
    <type>
      <types>EnumRef.ЦветЭтапа</types>
    </type>
  </attributes>
</mdclass:Catalog>

PCIS_prod/src/Catalogs/Проект/ObjectModule.bsl
///Модуль объекта справочника "Проект"

Процедура ПриЗаписи(Отказ, РежимЗаписи, РежимПроведения)        Если НЕ ЗначениеЗаполнено(ПланДатаНачала) Или НЕ ЗначениеЗаполнено(ПланДатаОкончания) Тогда        Возврат;    КонецЕсли;        Если ПланДатаНачала > ПланДатаОкончания Тогда        Отказ = Истина;        Сообщить("Ошибка: план дата начала не может быть позже даты окончания");        Возврат;    КонецЕсли;        Запрос = Новый Запрос;    Запрос.Текст =    "ВЫБРАТЬ ПЕРВЫЕ 1    |   Этап.Ссылка    |ИЗ    |   Справочник.Этап КАК Этап    |ГДЕ    |   Этап.Владелец = &Проект";        Запрос.УстановитьПараметр("Проект", Ссылка);        Если Запрос.Выполнить().Пустой() Тогда        Возврат;    КонецЕсли;        Запрос = Новый Запрос;    Запрос.Текст =    "ВЫБРАТЬ    |   Этап.ПланДатаНачала,    |   Этап.ПланДатаОкончания    |ИЗ    |   Справочник.Этап КАК Этап    |ГДЕ    |   Этап.Владелец = &Проект";        Запрос.УстановитьПараметр("Проект", Ссылка);    Выборка = Запрос.Выполнить().Выбрать();        Пока Выборка.Следующий() Цикл        Если ЗначениеЗаполнено(Выборка.ПланДатаНачала) И Выборка.ПланДатаНачала < ПланДатаНачала Тогда            Отказ = Истина;            Сообщить("Ошибка: план дата начала проекта не может быть позже даты начала этапа");            Возврат;        КонецЕсли;                Если ЗначениеЗаполнено(Выборка.ПланДатаОкончания) И Выборка.ПланДатаОкончания > ПланДатаОкончания Тогда            Отказ = Истина;            Сообщить("Ошибка: план дата окончания проекта не может быть раньше даты окончания этапа");            Возврат;        КонецЕсли;    КонецЦикла;    КонецПроцедуры
